<template>
  <div class="rules">
		<p class="rules__title">翼修入驻须知</p>

		<div class="content">
			<p class="content__clause">第一章 入驻须知 </p>
			<p>翼修暂未授权任何机构进行代理招商服务，入驻申请流程及相关的收费说明均以官方招商页面为准。</p>

			<p>翼修有权根据包括但不仅限于品牌需求、公司经营状况、服务水平等其他因素退回客户申请；同时翼修有权在申请入驻及后续经营阶段要求客户提供其他资质；翼修将结合各行业发展动态、国家相关规定及消费者购买需求，不定期更新招商标准。    </p>

			<p>商家必须如实提供资料和信息。    </p>
			<p>（一） 请务必确保您申请入驻及后续经营阶段提供的相关资质和信息的真实性（若您提供的相关资质为第三方提供，包括但不限于商标注册证、授权书等，请务必先行核实文件的真实有效性），一旦发现虚假资质或信息的，您的公司将被列入非诚信客户名单，翼修将不再与您进行合作；    </p>
			<p>（二） 商家应如实提供其店铺运营的主体及相关信息，包括但不限于代理运营商、实际店铺经营主体等信息；   </p>
			<p>（三） 翼修关于商家信息和资料变更有相关规定的从其规定，但商家如变更第二款所列信息，应（提前十五天）书面告知翼修。     </p>
			<p class="content__clause">第二章 翼修店铺类型及相关要求      </p>
			<p>旗舰店，商家以自有品牌，或由权利人独占性授权，入驻翼修开设的平台。     </p>
			<p>（一） 旗舰店，可以有以下几种情形：       </p>
			<p>1、 经营一个自有品牌商品的旗舰店；       </p>
			<p>2、 经营多个自有品牌商品且各品牌归同一实际控制人；</p>
			<p>3、 卖场型品牌（服务类商标）所有者开设的旗舰店；  </p>
			<p>其中2、3两种类型旗舰店仅限翼修主动邀请入驻。     </p>
			<p>（二） 开店主体必须是品牌（商标）权利人或持有权利人出具的开设翼修旗舰店独占性授权文件的企业。    </p>
			<p>专卖店，商家持他人品牌授权文件在翼修开设的店铺。    </p>
			<p>（一） 专卖店有以下几种情形：         </p>
			<p>1、 经营一个授权销售品牌商品的专卖店；         </p>
			<p>2、 经营多个授权销售品牌的商品且各品牌归同一实际控制人的专卖店；</p>
			<p>其中第2点所述类型的专卖店仅限翼修主动邀请入驻。   </p>
			<p class="content__clause">第三章 翼修申请入驻资质标准</p>
			<p>商家应向翼修提供有效营业执照副本、资质证书、法人代表身份证原件及其身份证复印件    </p>
			<p class="content__clause">第四章 开店入驻限制    </p>
			<p>同一主体重新入驻翼修限制： </p>
			<p>（一） 严重违规、资质造假被翼修清退的，永久限制入驻；    </p>
			<p>（二） 商家一自然年内主动退出2次，6个月内限制入驻。     </p>
			<p class="content__clause">第五章 翼修保证金/费率标准       </p>
			<p>保证金：服务商在翼修经营必须交纳保证金，保证金主要用于保证商家按照翼修的规则进行经营，并且在商家有违规行为时根据《翼修服务协议》及相关规则规定用于向翼修及消费者支付违约金。续约商家须在当年续签要求的时间内一次性缴纳次年度保证金；新签商家在申请入驻获得批准时一次性缴纳当年度的保证金3000元。保证金不足额时，商家需要在15日内补足余额，逾期未补足的翼修将对商家店铺进行监管，直至补足。 </p>    
			<p>如商家与翼修的协议有效期起始时间均在2018年内的，如商家与翼修的协议有效期跨自然年的。</p>
			<p class="content__clause">第六章 续约</p>
			<p>续签须在合同结束前30天之前完成续签申请的提交，并在合同结束15天之前完成年费的缴纳及保证金的锁定，如果上一年及下一年资费及资料未补足，翼修将在7天内监管店铺并清退出翼修平台。  </p>
			<p class="content__clause">第七章 退出</p>
			<p>保证金的返还结算在协议终止后15天进行返还。</p>
		</div>

		<cube-button @click="agree">我同意</cube-button>

	</div>
</template>

<script>
export default {
  methods: {
		agree () {
			this.$router.push('/businessRegister');
		}
	}
}
</script>

<style scoped>
.rules {
	width: 100%;
}

.rules .rules__title {
	padding: 10px 0;
	text-align: center;
	background: #ffbd5c;
	color: #fff;
}

.content {
	width: 96%;
	padding: 2%;
}

.content p {
	text-indent: 2em;
}

.content .content__clause {
	text-align: center;
	font-weight: bold;
	font-size: 20px;
	text-indent: 0;
}
</style>
