<template>
  	<div class="payBail">
      <item-header
        :name="name"
        @backParent="back"
      />
      <div class="rules">

        <div class="content">
          <p class="content__clause">第一章 入驻须知 </p>
          <p>翼修暂未授权任何机构进行代理招商服务，入驻申请流程及相关的收费说明均以官方招商页面为准。</p>

          <p>翼修有权根据包括但不仅限于品牌需求、公司经营状况、服务水平等其他因素退回客户申请；同时翼修有权在申请入驻及后续经营阶段要求客户提供其他资质；翼修将结合各行业发展动态、国家相关规定及消费者购买需求，不定期更新招商标准。</p>

          <p>商家必须如实提供资料和信息。</p>
          <p>（一） 请务必确保您申请入驻及后续经营阶段提供的相关资质和信息的真实性（若您提供的相关资质为第三方提供，包括但不限于商标注册证、授权书等，请务必先行核实文件的真实有效性），一旦发现虚假资质或信息的，您的公司将被列入非诚信客户名单，翼修将不再与您进行合作；</p>
          <p>（二） 商家应如实提供其店铺运营的主体及相关信息，包括但不限于代理运营商、实际店铺经营主体等信息；</p>
          <p>（三） 翼修关于商家信息和资料变更有相关规定的从其规定，但商家如变更第二款所列信息，应（提前十五天）告知翼修。</p>
          <p class="content__clause">第二章 翼修店铺类型及相关要求</p>
          <p>旗舰店，商家以自有品牌，或由权利人独占性授权，入驻翼修开设的平台。</p>
          <p>（一） 旗舰店，可以有以下几种情形： </p>
          <p>1、 经营一个自有品牌商品的旗舰店；</p>
          <p>2、 经营多个自有品牌商品且各品牌归同一实际控制人；</p>
          <p>3、 卖场型品牌（服务类商标）所有者开设的旗舰店；</p>
          <p>其中2、3两种类型旗舰店仅限翼修主动邀请入驻。</p>
          <p>（二） 开店主体必须是品牌（商标）权利人或持有权利人出具的开设翼修旗舰店独占性授权文件的企业。</p>
          <p>专卖店，商家持他人品牌授权文件在翼修开设的店铺。</p>
          <p>（一） 专卖店有以下几种情形：</p>
          <p>1、 经营一个授权销售品牌商品的专卖店；</p>
          <p>2、 经营多个授权销售品牌的商品且各品牌归同一实际控制人的专卖店；</p>
          <p>其中第2点所述类型的专卖店仅限翼修主动邀请入驻。   </p>
          <p class="content__clause">第三章 翼修申请入驻资质标准</p>
          <p>商家应向翼修提供有效营业执照副本、资质证书、法人代表身份证原件及其身份证复印件</p>
          <p class="content__clause">第四章 开店入驻限制</p>
          <p>同一主体重新入驻翼修限制： </p>
          <p>（一） 严重违规、资质造假被翼修清退的，永久限制入驻；</p>
          <p>（二） 商家一自然年内主动退出2次，6个月内限制入驻。</p>
          <p class="content__clause">第五章 翼修保证金/费率标准</p>
          <p>保证金：服务商在翼修经营必须交纳保证金，保证金主要用于保证商家按照翼修的规则进行经营，并且在商家有违规行为时根据《翼修服务协议》及相关规则规定用于向翼修及消费者支付违约金。续约商家须在当年续签要求的时间内一次性缴纳次年度保证金；保证金不足额时，商家需要在15日内补足余额，逾期未补足的翼修将对商家店铺进行监管，直至补足。</p>    
          <p>新签商家在申请入驻获得批准时一次性缴纳当年度的保证金3000元。如商家与翼修的协议有效期起始时间均在2018年内的，如商家与翼修的协议有效期跨自然年的。</p>
          <p class="content__clause">第六章 续约</p>
          <p>续签须在合同结束前30天之前完成续签申请的提交，并在合同结束15天之前完成年费的缴纳及保证金的锁定，如果上一年及下一年资费及资料未补足，翼修将在7天内监管店铺并清退出翼修平台。</p>
          <p class="content__clause">第七章 退出</p>
          <p>保证金的返还结算在协议终止后15天进行返还。</p>

          <p class="content__clause">第八章 甲乙双方的权利与责任</p>
          <p>甲方（重庆梦起远洋商贸有限责任公司）</p>
          <p>乙方（入驻平台商家）</p>
          <p>一.甲方权责</p>
          <p>1.甲方对翼修平台及相关附属项目产品拥有知识产权与所有权。甲方保证其提供的所有项目知识产权的合法性，保证内容不违反中国的法律法规及社会公德，并保证由此产生的一切纠纷与损失均由甲方承担。</p>
          <p>2.甲方授权乙方所运营项目的品牌、标识、图片、相关文件及制度、规范均由甲方提供，所有权均为甲方所有。在授权期间，乙方不得擅自改换商标图案及标识，不得更换产品包装和名称。</p>
          <p>3.甲方负责向乙方提供电子版的产品手册、宣传单页及其他的相关资料，以便乙方开展宣传及招商活动。</p>
          <p>4.在项目开展过程中，甲方应及时配合加盟商，提供产品支持、资料支持、技术支持、服务支持，并指导乙方开展工作。</p>
          <p>5.甲方在本协议有效期内每年度与乙方确认本年度的完成目标，乙方应尽最大努力，争取完成或超额完成双方协定的年度目标并保持逐年增长。如乙方未完成双方协定的目标或有损害合作双方利益的事实，甲方有权按本协议取消乙方的经销权。</p>
          <p>6.甲方有义务在全国性媒介或专业杂志上进行相关市场推广活动与品牌宣传，同时乙方有责任在当地市场做推广活动和品牌宣传。</p>
          <p>7.乙方享有在授权区域内独家运营权，甲方保证在合同有效期内不在乙方授权区域内以任何形式另授权于第三方经销商。</p>
          <p>8.甲方为乙方提供相关的电子商务销售服务。</p>
          <p>9.甲方网上销售的产品均须由乙方合法获得，保证决不销售来历不明的产品。</p>
          <p>10.甲方负责店铺以及产品的页面设计、产品信息优化、营销推广、数据分析等工作。该团队提供服务岗位包括：项目运营、营销推广、页面设计、文案策划,客户服务等。</p>
          <p>11.甲方未经乙方允许的情况下，不得将乙方的保密信息资料外泄。若因此造成甲方利益受损甲方愿意赔偿乙方的全部损失。</p>
          <p>12.甲方保证给予乙方的代理条件与给予其他代理机构或公司的条件是一致的。</p>
          <p>13.协助乙方带领客户购买产品。</p>
          <p>14.在乙方需要时及时通报该产品的状况和相应价格调整情况。</p>
          <p>15.协助乙方解决客户疑问和纠纷，保证交易过程真实。</p>
          <p>16.若乙方招代理商成功，甲方需按合同约定支付乙方招商佣金。</p>
          <p>17.若合作期间内乙方违反“乙方的责任和义务”甲方有权终止合同。</p>
          <p>18.甲方在合同期内享有翼修平台成交金额20%的提成。</p>

          <p>二.乙方权责</p>
          <p>1.在授权期内，乙方有权以“翼修平台”的名义从事本协议的一切合法活动。</p>
          <p>2.发展渠道：乙方有权利和义务大力发展本地销售渠道，并接受甲方的指导和监督。</p>
          <p>3.维护市场秩序：乙方有权利和义务与甲方共同维护市场秩序和企业形象。</p>
          <p>4.乙方应定期向甲方反馈市场信息，以利双方及时调整市场策略。</p>
          <p>5.乙方可以有义务积极配合甲方全国性或区域性销售及宣传活动，收集当地的信息并及时反馈给甲方。</p>
          <p>6.乙方有权直接或间接使用、转载甲方网站、手册的描述或图案、视频、但不可以夸大其词，避实就虚。</p>
          <p>7.乙方不得有损甲方的形象及声誉。若因此造成甲方形象或声誉损害的，甲方有权终止合作协议，严重者追究其相应法律责任。</p>
          <p>8.乙方如有违反本协议规定之条款，甲方将以书面形式通知乙方解除协议，并追究乙方违约责任。</p>
          <p>9.在合作期内，乙方有义务为甲方的信息进行保密，信息包括：产品计划、销售计划、奖励政策、客户清单、财务信息、技术秘密等、未经甲方书面授权许可，乙方不得向任何第三方泄密。如由此而造成甲方的经济损失与法律责任，由乙方全部承担。</p>
          <p>10.乙方为甲方提供网上销售产品价格以及相关资料，并确保产品真实有效。 </p>
          <p>11.乙方需配置一名或以上人员专门负责与乙方对接各项电子商务营销工作，并积极处理好售后问题，如退换货、退款、处理买家的投诉维权等工作。</p>
          <p>12.乙方负责创建专供电子商务销售的产品仓库，并配置适用的电子商务仓库管理系统与设备；制定电子商务发货管理办法，合理安排该仓库的管理人员，保证满足日常发货需求。如因乙方发货不及时、漏发货、发错货等所产生的客户纠纷与损失均由乙方承担。 </p>
          <p>13.若服务期间内乙方违反“乙方的责任和义务”甲方有权终止合同。</p>
          <p>14.合作期满，在同等条件下乙方享有优先续约权但必须提前两个月向甲方提出申请，并在遵守甲方新的加盟政策准入条下，与甲方续约。续约之日甲方会根据乙方在上一年翼修平台服务评分标准对保证金作相应扣除，若扣除后保证金不足￥3000元，乙方应补足人民币 ￥3000元剩余部分方可继续合作。</p>			
        </div>

      </div>
		<van-button @click="surePayBail" bottom-action>
      <sicon name="nextStep" scale="1.8"></sicon><span>缴纳保证金￥{{this.totalFee}}</span>
    </van-button>
	</div>
</template>


<script>
import { Button, Dialog } from "vant";
import itemHeader from '../components/itemHeader';
import wx from "weixin-js-sdk";
export default {
  components: {
	[Button.name]: Button,
  [Dialog.name]: Dialog,
  itemHeader
  },
  data() {
    return {
	  totalFee: 3000,
    shopId: "",
    name: '缴纳保证金'
    };
  },
  methods: {
    back () {
      this.$router.push('/sellerHome');
    },
    surePayBail: function() {
	  console.log(this.totalFee);
	  this.shopId = JSON.parse(localStorage.getItem('shopData'))._id
	  Dialog.confirm({
          title: '是否立即支付',
        }).then(() => {
		  // on confirm
		  console.log(this);
		  let payInfo = {
			  shopId:this.shopId,
			  totalFee: this.totalFee*100
		  }
          this._pay(payInfo);
        }).catch(() => {
          // on cancel
          console.log("取消");
        });
    },
    _pay: function(payInfo) {
      let isWxMini;
      // console.log(data);
      isWxMini = window.__wxjs_environment === "miniprogram";

      if (isWxMini) {
        console.log(isWxMini);
        let jumpUrl = encodeURIComponent(window.location.origin);
        let path = `/pages/wxpay/wxpay?payInfo=${JSON.stringify(
          payInfo
        )}&jumpUrl=${jumpUrl}`;
        wx.miniProgram.navigateTo({
          url: path
        });
      } else {
        alert("非小程序环境");
      }
    }
  }
};
</script>

<style scoped>
.rules {
	width: 100%;
}

.rules .rules__title {
	padding: 10px 0;
	text-align: center;
	background: #ffbd5c;
	color: #fff;
}

.content {
	width: 96%;
	padding: 2%;
}

.content p {
	text-indent: 2em;
}

.content .content__clause {
	text-align: center;
	font-weight: bold;
	font-size: 20px;
	text-indent: 0;
}
</style>
